app/controllers/info_controller.rb

INSERT INTO "consumers" ("lti_key", "lti_secret", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["lti_key", "4408cc0b-06f2-4f5e-97f2-11077764452b"], ["lti_secret", nil], ["created_at", "2016-08-19 21:19:28.156826"], ["updated_at", "2016-08-19 21:19:28.156826"]]
---
  def home
    @new_client = Consumer.create!